---
kind: property
id: P:Autodesk.Revit.DB.FabricationRodInfo.IsAttachedToStructure
source: html/339aa765-d972-2aac-5e48-66c986c8291c.htm
---
# Autodesk.Revit.DB.FabricationRodInfo.IsAttachedToStructure Property

Checks if the hanger is attached to structure.

## Syntax (C#)
```csharp
public bool IsAttachedToStructure { get; }
```